---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.DiameterDimensionTypeId
source: html/ce5309b8-be6b-fdbd-49fe-8c3be5021dfc.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.DiameterDimensionTypeId Property

Identifies the Id of the diameter dimension type which is used to show dimensions.

## Syntax (C#)
```csharp
public ElementId DiameterDimensionTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property:
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null